package main

import (
	"context"
	"sync"
)

// -------------------------------------------------------------------------------------------------------------------------
// #1
func task6_1() { // завершение горутины с помощью return, например по условию
	someCondition := true
	go func() {
		if someCondition {
			return
		}

	}()
}

// -------------------------------------------------------------------------------------------------------------------------
// #2
func t6_worker_1(stopChan <-chan struct{}) { // Завершение горутины при получении какого-либо сигнала через канал
	for {
		select {
		case <-stopChan:
			// Получен сигнал остановки => завершение работы
			return
		default:

		}
	}
}

func task6_2() {
	stopChan := make(chan struct{})
	go t6_worker_1(stopChan)

	close(stopChan) // остановка с помощью закрытия канала
}

// -------------------------------------------------------------------------------------------------------------------------
// #3
// остановка с помощью "контекста"
func t6_worker_2(ctx context.Context) {
	for {
		select {
		case <-ctx.Done(): // отслеживание сигнала остановки

			return
		default:
			// программа
		}
	}
}

func task6_3() {
	ctx, cancel := context.WithCancel(context.Background())
	go t6_worker_2(ctx)

	cancel() // остановка горутин
}

// -------------------------------------------------------------------------------------------------------------------------
// #4
var wg sync.WaitGroup

func t6_worker_3() {
	defer wg.Done()
	// Программа
}

func task6_4() {
	wg.Add(1)
	go t6_worker_3()

	wg.Wait() // ожидаем завершения горутины
}

//-------------------------------------------------------------------------------------------------------------------------
